Table of Contents
 Class ConcreteCheckDetailing
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Check Detailing base
public abstract class ConcreteCheckDetailing : ConcreteCheckResultBase
Inheritance
object
ConcreteCheckResultBase
ConcreteCheckDetailing
Derived
ConcreteCheckDetailingEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
 Edit this page